stm32-rs/stm32l0xx-hal/src/serial.rs
use core::fmt;
use core::marker::PhantomData;
use core::ptr;

use nb::block;

use crate::gpio::{AltMode, PinMode};
use crate::hal;
use crate::hal::prelude::*;
pub use crate::pac::{LPUART1, USART1, USART2, USART4, USART5};
use crate::rcc::{Rcc, LSE};

#[cfg(any(feature = "stm32l0x2", feature = "stm32l0x3"))]
use core::{
    ops::{Deref, DerefMut},
    pin::Pin,
};

#[cfg(any(feature = "stm32l0x2", feature = "stm32l0x3"))]
use as_slice::{AsMutSlice, AsSlice};

#[cfg(any(feature = "stm32l0x2", feature = "stm32l0x3"))]
pub use crate::dma;

#[cfg(any(feature = "stm32l0x2", feature = "stm32l0x3"))]
use crate::dma::Buffer;

#[cfg(any(
    feature = "io-STM32L031",
    feature = "io-STM32L051",
    feature = "io-STM32L071"
))]
use crate::gpio::gpioc::*;
use crate::gpio::{gpioa::*, gpiob::*};
#[cfg(any(feature = "io-STM32L071"))]
use crate::gpio::{gpiod::*, gpioe::*};

/// Serial error
#[derive(Debug)]
#[non_exhaustive]
pub enum Error {
    /// Framing error
    Framing,
    /// Noise error
    Noise,
    /// RX buffer overrun
    Overrun,
    /// Parity check error
    Parity,
}

/// Interrupt event
pub enum Event {
    /// New data has been received.
    ///
    /// This event is cleared by reading a character from the UART.
    Rxne,
    /// New data can be sent.
    ///
    /// This event is cleared by writing a character to the UART.
    ///
    /// Note that this event does not mean that the character in the TX buffer
    /// is fully transmitted. It only means that the TX buffer is ready to take
    /// another character to be transmitted.
    Txe,
    /// Idle line state detected.
    Idle,
}

use crate::time::Bps;
use crate::time::U32Ext;

pub enum WordLength {
    DataBits8,
    DataBits9,
}

pub enum Parity {
    ParityNone,
    ParityEven,
    ParityOdd,
}

pub enum StopBits {
    #[doc = "1 stop bit"]
    STOP1,
    #[doc = "0.5 stop bits"]
    STOP0P5,
    #[doc = "2 stop bits"]
    STOP2,
    #[doc = "1.5 stop bits"]
    STOP1P5,
}

pub struct Config {
    pub baudrate: Bps,
    pub wordlength: WordLength,
    pub parity: Parity,
    pub stopbits: StopBits,
}

impl Config {
    pub fn baudrate(mut self, baudrate: Bps) -> Self {
        self.baudrate = baudrate;
        self
    }

    pub fn parity_none(mut self) -> Self {
        self.parity = Parity::ParityNone;
        self
    }

    pub fn parity_even(mut self) -> Self {
        self.parity = Parity::ParityEven;
        self
    }

    pub fn parity_odd(mut self) -> Self {
        self.parity = Parity::ParityOdd;
        self
    }

    pub fn wordlength_8(mut self) -> Self {
        self.wordlength = WordLength::DataBits8;
        self
    }

    pub fn wordlength_9(mut self) -> Self {
        self.wordlength = WordLength::DataBits9;
        self
    }

    pub fn stopbits(mut self, stopbits: StopBits) -> Self {
        self.stopbits = stopbits;
        self
    }
}

#[derive(Debug)]
pub struct InvalidConfig;

impl Default for Config {
    fn default() -> Config {
        let baudrate = 9_600_u32.bps();
        Config {
            baudrate,
            wordlength: WordLength::DataBits8,
            parity: Parity::ParityNone,
            stopbits: StopBits::STOP1,
        }
    }
}

/// Trait to mark serial pins with transmit capability.
pub trait TxPin<USART> {
    fn setup(&self);
}

/// Trait to mark serial pins with receive capability.
pub trait RxPin<USART> {
    fn setup(&self);
}

/// Macro to implement `TxPin` / `RxPin` for a certain pin, using a certain
/// alternative function and for a certain serial peripheral.
macro_rules! impl_pins {
    ($($pin:ident, $alt:ident, $instance:ty, $trait:ident;)*) => {
        $(
            impl<MODE: PinMode> $trait<$instance> for $pin<MODE> {
                fn setup(&self) {
                    self.set_alt_mode(AltMode::$alt);
                }
            }
        )*
    }
}

#[cfg(feature = "io-STM32L021")]
impl_pins!(
    PA0, AF0, USART2, RxPin;
    PA0, AF6, LPUART1, RxPin;
    PA1, AF6, LPUART1, TxPin;
    PA2, AF4, USART2, TxPin;
    PA2, AF6, LPUART1, TxPin;
    PA3, AF4, USART2, RxPin;
    PA3, AF6, LPUART1, RxPin;
    PA4, AF6, LPUART1, TxPin;
    PA9, AF4, USART2, TxPin;
    PA10, AF4, USART2, RxPin;
    PA13, AF6, LPUART1, RxPin;
    PA14, AF4, USART2, TxPin;
    PA14, AF6, LPUART1, TxPin;
    PA15, AF4, USART2, RxPin;
    PB6, AF0, USART2, TxPin;
    PB6, AF6, LPUART1, TxPin;
    PB7, AF0, USART2, RxPin;
    PB7, AF6, LPUART1, RxPin;
    PB8, AF0, USART2, TxPin;
);

#[cfg(feature = "io-STM32L031")]
impl_pins!(
    PA2, AF4, USART2, TxPin;
    PA2, AF6, LPUART1, TxPin;
    PA3, AF4, USART2, RxPin;
    PA3, AF6, LPUART1, RxPin;
    PA9, AF4, USART2, TxPin;
    PA10, AF4, USART2, RxPin;
    PA13, AF6, LPUART1, RxPin;
    PA14, AF4, USART2, TxPin;
    PA14, AF6, LPUART1, TxPin;
    PA15, AF4, USART2, RxPin;
    PB6, AF0, USART2, TxPin;
    PB7, AF0, USART2, RxPin;
    PB10, AF6, LPUART1, TxPin;
    PB11, AF6, LPUART1, RxPin;
    PC0, AF6, LPUART1, RxPin;
);

#[cfg(feature = "io-STM32L051")]
impl_pins!(
    PA2, AF4, USART2, TxPin;
    PA3, AF4, USART2, RxPin;
    PA9, AF4, USART1, TxPin;
    PA10, AF4, USART1, RxPin;
    PA14, AF4, USART2, TxPin;
    PA15, AF4, USART2, RxPin;
    PB6, AF0, USART1, TxPin;
    PB7, AF0, USART1, RxPin;
    PB10, AF4, LPUART1, TxPin;
    PB11, AF4, LPUART1, RxPin;
    PC4, AF2, LPUART1, TxPin;
    PC5, AF2, LPUART1, RxPin;
    PC10, AF0, LPUART1, TxPin;
    PC11, AF0, LPUART1, RxPin;
);

#[cfg(feature = "io-STM32L071")]
impl_pins!(
    PA0, AF6, USART4, TxPin;
    PA1, AF6, USART4, RxPin;
    PA2, AF4, USART2, TxPin;
    PA2, AF6, LPUART1, TxPin;
    PA3, AF4, USART2, RxPin;
    PA3, AF6, LPUART1, RxPin;
    PA9, AF4, USART1, TxPin;
    PA10, AF4, USART1, RxPin;
    PA13, AF6, LPUART1, RxPin;
    PA14, AF4, USART2, TxPin;
    PA14, AF6, LPUART1, TxPin;
    PA15, AF4, USART2, RxPin;
    PB3, AF6, USART5, TxPin;
    PB4, AF6, USART5, RxPin;
    PB6, AF0, USART1, TxPin;
    PB7, AF0, USART1, RxPin;
    PB10, AF4, LPUART1, TxPin;
    PB10, AF7, LPUART1, RxPin;
    PB11, AF4, LPUART1, RxPin;
    PB11, AF7, LPUART1, TxPin;
    PC0, AF6, LPUART1, RxPin;
    PC1, AF6, LPUART1, TxPin;
    PC4, AF2, LPUART1, TxPin;
    PC5, AF2, LPUART1, RxPin;
    PC10, AF0, LPUART1, TxPin;
    PC10, AF6, USART4, TxPin;
    PC11, AF0, LPUART1, RxPin;
    PC11, AF6, USART4, RxPin;
    PC12, AF2, USART5, TxPin;
    PD2, AF6, USART5, RxPin;
    PD5, AF0, USART2, TxPin;
    PD6, AF0, USART2, RxPin;
    PD8, AF0, LPUART1, TxPin;
    PD9, AF0, LPUART1, RxPin;
    PE8, AF6, USART4, TxPin;
    PE9, AF6, USART4, RxPin;
    PE10, AF6, USART5, TxPin;
    PE11, AF6, USART5, RxPin;
);

/// Serial abstraction
pub struct Serial<USART> {
    usart: USART,
    rx: Rx<USART>,
    tx: Tx<USART>,
}

